redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_FM_OFF_1nd/redis_result_Sequential110_FM_OFF_P4_1nd_20230717195740.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        34808.24          ---          ---         2.55101         2.49500         5.02300         5.59900     37595.62 
Gets         3479.81      3479.81         0.00         2.55235         2.49500         5.02300         5.59900      3741.48 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      38288.05      3479.81         0.00         2.55113         2.49500         5.02300         5.59900     41337.09 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.311        0.000
SET       2.255        5.000
SET       2.335       10.000
SET       2.367       15.000
SET       2.399       20.000
SET       2.415       25.000
SET       2.431       30.000
SET       2.447       35.000
SET       2.463       40.000
SET       2.479       45.000
SET       2.495       50.000
SET       2.511       52.500
SET       2.511       55.000
SET       2.527       57.500
SET       2.527       60.000
SET       2.543       62.500
SET       2.559       65.000
SET       2.575       67.500
SET       2.591       70.000
SET       2.607       72.500
SET       2.639       75.000
SET       2.639       76.250
SET       2.655       77.500
SET       2.671       78.750
SET       2.671       80.000
SET       2.687       81.250
SET       2.687       82.500
SET       2.703       83.750
SET       2.703       85.000
SET       2.719       86.250
SET       2.735       87.500
SET       2.735       88.125
SET       2.751       88.750
SET       2.751       89.375
SET       2.751       90.000
SET       2.767       90.625
SET       2.767       91.250
SET       2.783       91.875
SET       2.783       92.500
SET       2.799       93.125
SET       2.815       93.750
SET       2.815       94.062
SET       2.815       94.375
SET       2.831       94.688
SET       2.831       95.000
SET       2.847       95.312
SET       2.847       95.625
SET       2.863       95.938
SET       2.863       96.250
SET       2.879       96.562
SET       2.895       96.875
SET       2.895       97.031
SET       2.911       97.188
SET       2.927       97.344
SET       2.943       97.500
SET       3.007       97.656
SET       4.047       97.812
SET       4.607       97.969
SET       4.767       98.125
SET       4.831       98.281
SET       4.895       98.438
SET       4.895       98.516
SET       4.927       98.594
SET       4.927       98.672
SET       4.959       98.750
SET       4.991       98.828
SET       4.991       98.906
SET       5.023       98.984
SET       5.055       99.062
SET       5.055       99.141
SET       5.087       99.219
SET       5.119       99.258
SET       5.151       99.297
SET       5.183       99.336
SET       5.215       99.375
SET       5.247       99.414
SET       5.279       99.453
SET       5.311       99.492
SET       5.343       99.531
SET       5.375       99.570
SET       5.375       99.609
SET       5.407       99.629
SET       5.407       99.648
SET       5.407       99.668
SET       5.439       99.688
SET       5.439       99.707
SET       5.439       99.727
SET       5.471       99.746
SET       5.471       99.766
SET       5.503       99.785
SET       5.503       99.805
SET       5.503       99.814
SET       5.535       99.824
SET       5.535       99.834
SET       5.535       99.844
SET       5.567       99.854
SET       5.567       99.863
SET       5.567       99.873
SET       5.599       99.883
SET       5.599       99.893
SET       5.631       99.902
SET       5.631       99.907
SET       5.631       99.912
SET       5.631       99.917
SET       5.631       99.922
SET       5.663       99.927
SET       5.663       99.932
SET       5.663       99.937
SET       5.663       99.941
SET       5.695       99.946
SET       5.695       99.951
SET       5.695       99.954
SET       5.695       99.956
SET       5.695       99.958
SET       5.695       99.961
SET       5.727       99.963
SET       5.727       99.966
SET       5.727       99.968
SET       5.727       99.971
SET       5.727       99.973
SET       5.759       99.976
SET       5.759       99.977
SET       5.759       99.978
SET       5.759       99.979
SET       5.759       99.980
SET       5.759       99.982
SET       5.759       99.983
SET       5.791       99.984
SET       5.791       99.985
SET       5.791       99.987
SET       5.791       99.988
SET       5.791       99.988
SET       5.791       99.989
SET       5.823       99.990
SET       5.823       99.990
SET       5.823       99.991
SET       5.823       99.991
SET       5.823       99.992
SET       5.823       99.993
SET       5.855       99.993
SET       5.855       99.994
SET       5.855       99.994
SET       5.887       99.995
SET       5.919       99.995
SET       5.951       99.995
SET       6.047       99.995
SET       6.271       99.996
SET       6.399       99.996
SET       6.431       99.996
SET       6.495       99.997
SET       6.559       99.997
SET       6.783       99.997
SET       6.975       99.997
SET       7.039       99.997
SET       7.103       99.998
SET       7.135       99.998
SET       7.135       99.998
SET       7.199       99.998
SET       7.327       99.998
SET       7.327       99.998
SET       7.359       99.998
SET       7.359       99.999
SET       7.423       99.999
SET       7.455       99.999
SET       7.455       99.999
SET       7.487       99.999
SET       7.487       99.999
SET       7.519       99.999
SET       8.447       99.999
SET       8.511       99.999
SET       8.511       99.999
SET       8.511       99.999
[...]
SET       8.575       99.999
SET       8.575       99.999
SET       8.575       99.999
SET       8.575      100.000
SET       8.575      100.000
SET       8.575      100.000
SET       8.639      100.000
SET       8.639      100.000
SET       8.639      100.000
[...]
SET       8.703      100.000
SET       8.703      100.000
SET       8.703      100.000
[...]
SET       9.215      100.000
SET       9.215      100.000
---
GET       0.695        0.000
GET       2.255        5.000
GET       2.335       10.000
GET       2.383       15.000
GET       2.399       20.000
GET       2.415       25.000
GET       2.431       30.000
GET       2.447       35.000
GET       2.463       40.000
GET       2.479       45.000
GET       2.495       50.000
GET       2.511       52.500
GET       2.511       55.000
GET       2.527       57.500
GET       2.527       60.000
GET       2.543       62.500
GET       2.559       65.000
GET       2.575       67.500
GET       2.591       70.000
GET       2.607       72.500
GET       2.639       75.000
GET       2.639       76.250
GET       2.655       77.500
GET       2.671       78.750
GET       2.671       80.000
GET       2.687       81.250
GET       2.687       82.500
GET       2.703       83.750
GET       2.719       85.000
GET       2.719       86.250
GET       2.735       87.500
GET       2.735       88.125
GET       2.751       88.750
GET       2.751       89.375
GET       2.767       90.000
GET       2.767       90.625
GET       2.783       91.250
GET       2.783       91.875
GET       2.799       92.500
GET       2.799       93.125
GET       2.815       93.750
GET       2.815       94.062
GET       2.815       94.375
GET       2.831       94.688
GET       2.831       95.000
GET       2.847       95.312
GET       2.847       95.625
GET       2.863       95.938
GET       2.863       96.250
GET       2.879       96.562
GET       2.895       96.875
GET       2.895       97.031
GET       2.911       97.188
GET       2.911       97.344
GET       2.943       97.500
GET       2.975       97.656
GET       3.471       97.812
GET       4.511       97.969
GET       4.703       98.125
GET       4.799       98.281
GET       4.863       98.438
GET       4.895       98.516
GET       4.895       98.594
GET       4.927       98.672
GET       4.959       98.750
GET       4.959       98.828
GET       4.991       98.906
GET       5.023       98.984
GET       5.023       99.062
GET       5.055       99.141
GET       5.087       99.219
GET       5.087       99.258
GET       5.119       99.297
GET       5.151       99.336
GET       5.215       99.375
GET       5.247       99.414
GET       5.279       99.453
GET       5.311       99.492
GET       5.343       99.531
GET       5.375       99.570
GET       5.375       99.609
GET       5.407       99.629
GET       5.407       99.648
GET       5.407       99.668
GET       5.407       99.688
GET       5.439       99.707
GET       5.439       99.727
GET       5.471       99.746
GET       5.471       99.766
GET       5.471       99.785
GET       5.503       99.805
GET       5.503       99.814
GET       5.503       99.824
GET       5.535       99.834
GET       5.535       99.844
GET       5.535       99.854
GET       5.535       99.863
GET       5.567       99.873
GET       5.567       99.883
GET       5.599       99.893
GET       5.599       99.902
GET       5.599       99.907
GET       5.631       99.912
GET       5.631       99.917
GET       5.631       99.922
GET       5.631       99.927
GET       5.663       99.932
GET       5.663       99.937
GET       5.663       99.941
GET       5.695       99.946
GET       5.695       99.951
GET       5.695       99.954
GET       5.695       99.956
GET       5.695       99.958
GET       5.695       99.961
GET       5.695       99.963
GET       5.727       99.966
GET       5.727       99.968
GET       5.727       99.971
GET       5.727       99.973
GET       5.727       99.976
GET       5.759       99.977
GET       5.759       99.978
GET       5.759       99.979
GET       5.759       99.980
GET       5.759       99.982
GET       5.791       99.983
GET       5.791       99.984
GET       5.791       99.985
GET       5.791       99.987
GET       5.791       99.988
GET       5.791       99.988
GET       5.791       99.989
GET       5.791       99.990
GET       5.823       99.990
GET       5.823       99.991
GET       5.823       99.991
GET       5.823       99.992
GET       5.823       99.993
GET       5.823       99.993
GET       5.855       99.994
GET       5.855       99.994
GET       5.855       99.995
GET       5.855       99.995
GET       5.919       99.995
GET       6.047       99.995
GET       6.047       99.996
GET       6.111       99.996
GET       6.111       99.996
GET       6.271       99.997
GET       6.271       99.997
GET       6.271       99.997
GET       7.007       99.997
GET       7.007       99.997
GET       7.007       99.998
GET       7.103       99.998
GET       7.103       99.998
GET       7.103       99.998
[...]
GET       7.167       99.998
GET       7.167       99.998
GET       7.167       99.999
GET       7.167       99.999
GET       7.167       99.999
[...]
GET       7.519       99.999
GET       7.519       99.999
GET       7.519       99.999
[...]
GET       8.639       99.999
GET       8.639      100.000
---
WAIT      0.000      100.000